#Задача№3
#По введенным пользователем координатам двух точек
#вывести уравнение прямой вида y = kx + b, проходящей через эти точки.
print("Введите координаты точки №1")
x1 = input("Введите x1:\n")
y1 = input("Введите y1:\n")
print("Введите координаты точки №2")
x2 = input("Введите x2:\n")
y2 = input("Введите y2:\n")


print(x1)
print(y1)
print(x2)
print(y2)